#ifndef PIO_DRIVER_H
#define PIO_DRIVER_H

/*********************************************************************
 * include files.
*********************************************************************/
#include "type.h"

/*********************************************************************
 * defines.
*********************************************************************/
#define PIO_SIGNAL_LV_H	( 255u )	/* 信号レベル ： H */
#define PIO_SIGNAL_LV_L	(   0u )	/* 信号レベル ： L */

/*********************************************************************
 * prototypes.
*********************************************************************/
extern void PIO_init(void);			/* ドライバ初期化機能 */
extern void PIO_write(uint8_t);		/* ポート書き込み機能 */
extern uint8_t PIO_read(void);		/* ポート読み込み機能 */

#endif
